# YOLOv5 ?? by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
#depth_multiple: 0.33  # model depth multiple
#width_multiple: 0.50  # layer channel multiple

depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors: 3
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32

# P1:320  P2:160  P3:80  P4:40  P5:20

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],# 0-P1/2                320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4                160
   [-1, 3, C3, [128]],          # 2                     160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8                80
   [-1, 6, C3, [256]],          # 4                     80
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16               40
   [-1, 9, C3, [512]],          # 6                     40
   [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32               20
   [-1, 3, C3TR, [1024]],       # 8                     20
   [-1, 1, SPPF, [1024, 5]],    # 9                     20
  ]

# YOLOv5 v6.0 head  # 实际CBAM无需参数
head:
  [[-1, 1, Conv, [1024, 1, 1]],                    # 10  20        p5_in
   [ 6, 1, Conv, [1024, 3, 2]],                    # 11  20        p4_in
   [-1, 1, CBAM, [1024]],                          # 12  20
   [10, 1, CBAM, [1024]],                          # 13  20
   [[-1, -2], 1, ConcatP5_up, [1024,1024]],        # 14  20
   [-1, 1, SPP, [1024,1024, [3, 5, 7]]],           # 15  20
   [-1, 3, C3, [1024, False]],                     # 16  20


   [-1, 1, Conv, [512, 1, 1]],                    # 17  20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 18  40
   [-1, 1, CBAM, [512]],                          # 19  40
   [10, 1, CBAM, [512]],                          # 20  40
   [ 6, 1, CBAM, [512]],                          # 21  40
   [[-1,-2,-3], 1, ConcatP4_up, [512,512]],       # 22  40 cat backbone P4   # 512：输入的通道数，输出的通道数     512
   [-1, 1, SPP, [512,512, [3, 7, 11]]],           # 23  40
   [-1, 3, C3, [512, False]],                     # 24  40

   [-1, 1, Conv, [256, 1, 1]],                    # 25  40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 26  80
   [-1, 1, CBAM, [256]],                          # 27  80
   [ 6, 1, CBAM, [256]],                          # 28  80
   [ 4, 1, CBAM, [256]],                          # 29  80
   [[-1, -2, -3], 1, ConcatP3_up, [256,256]],     # 30  80 cat backbone P3
   [-1, 1, SPP, [256,256, [3, 7, 11]]],           # 31  80
   [-1, 3, C3, [256, False]],                     # 32  80 (P3/8-small)
   
   [ -1, 1, Conv, [128, 1, 1]],                   # 33  80
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest'] ], # 34  160
   [-1, 1, CBAM, [128]],                          # 35  160
   [ 4, 1, CBAM, [128]],                          # 36  160
   [ 2, 1, CBAM, [128]],                          # 37  160
   [[-1,-2,-3], 1, ConcatP2_up, [128,128]],       # 38  160 cat backbone P2
   [-1, 1, SPP, [128,128, [5, 9, 13]]],           # 39
   [ -1, 3, C3, [ 128, False ] ],                 # 40  160

#-----------------------------------------------------------------------------------#

   [-1, 1, Conv, [128, 1, 1]],                    # 41   80
   [-1, 1, CBAM, [128]],                          # 42   80
   [34, 1, CBAM, [128]],                          # 43   80
   [ 2, 1, CBAM, [128]],                          # 44   80
   [[-1, -3, -4], 1, ConcatP2_out, [128,128]],    # 45 cat head P3 80
   [-1, 1, SPP, [128,128, [5, 9, 13]]],           # 46
   [-1, 3, C3,  [128, False]],                    # 47(P2/4-xsmall)


   [-1, 1, Conv, [128, 3, 2]],                    # 48   80
   [-1, 1, CBAM, [256]],                          # 49   80
   [26, 1, CBAM, [256]],                          # 50   80
   [33, 1, CBAM, [256]],                          # 51   80
   [4,  1, CBAM, [256]],                          # 52   80
   [[-1,-2,-3,-4], 1, ConcatP3_out, [256,256]],   # 53 cat head P3 80
   [-1, 1, SPP, [256,512, [3, 7, 11]]],           # 54
   [-1, 3, C3, [512, False]],                     # 55(P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],                    # 56   40
   [-1, 1, CBAM, [512]],                          # 57   40
   [18, 1, CBAM, [512]],                          # 58   40
   [25, 1, CBAM, [512]],                          # 59   40
   [6, 1,  CBAM, [512]],                          # 60   40
   [[-1,-2,-3,-4], 1, ConcatP4_out, [512,512]],   # 61 cat head P4
   [-1, 1, SPP, [512,1024, [3, 7, 11]]],          # 62
   [-1, 3, C3, [1024, False]],                    # 63(P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                    # 64
   [-1, 1, CBAM, [1024]],                         # 65  20
   [17, 1, CBAM, [1024]],                         # 66  20
   [10, 1, CBAM, [1024]],                         # 67  20
   [[-1,-2,-3], 1, ConcatP5_out, [1024,1024]],    # 68 cat head P5
   [-1, 1, SPP, [1024,1024, [3, 5, 7]]],          # 69
   [-1, 3, C3,  [1024,False]],                    # 70(P5/32-large)

   [[47,55, 63, 70], 1, Detect, [nc,anchors]],   # Detect(P2, P3, P4, P5)
  ]

#
