# YOLOv5 ?? by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
#depth_multiple: 0.33  # model depth multiple
#width_multiple: 0.50  # layer channel multiple
#
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
#depth_multiple: 1.33  # model depth multiple
#width_multiple: 1.25  # layer channel multiple

anchors: 3
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32

# P1:320  P2:160  P3:80  P4:40  P5:20

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],# 0-P1/2                320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4                160
   [-1, 3, C3, [128]],          # 2                     160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8                80
   [-1, 6, C3, [256]],          # 4                     80
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16               40
   [-1, 9, C3, [512]],          # 6                     40
   [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32               20
   [-1, 3, C3STR, [1024]],       # 8                     20
   [-1, 1, SPPF, [1024, 5]],    # 9                     20
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                    # 10  20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 11  40
   [-1, 1, LK, [512]],                            # 12  40
   [ 6, 1, LK, [512]],                            # 13  40
   [[-1, 12], 1, ConcatP4_up, [512,1024]],        # 14  40 cat backbone P4   # 256：输入的通道数，输出的通道数
   [-1, 3, C3, [512, False]],                     # 15  40

   [-1, 1, Conv, [256, 1, 1]],                    # 16  40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 17  80
   [-1, 1, LK, [256]],                            # 18  80
   [ 4, 1, LK, [256]],                            # 19  80
   [[-1, 18], 1, ConcatP3_up, [256,512]],         # 20  80 cat backbone P3
   [-1, 3, C3, [256, False]],                     # 21  80 (P3/8-small)

   [ -1, 1, Conv, [ 128, 1, 1 ] ],                # 22  80
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],# 23  160
   [-1, 1, LK, [128]],                            # 24  160
   [ 2, 1, LK, [128]],                            # 25  160
   [[-1,24], 1, ConcatP2_out, [128,256]],         # 26  160 cat backbone P2
   [-1, 1, SPP, [128, [5, 9, 13]]],               # 27
   [ -1, 3, C3, [ 128, False ] ],                 # 28  160 (P2/4-xsmall)

#-----------------------------------------------------------------------------------#

   [ -1, 1, Conv, [128, 3, 2]],                   # 29   80
   [-1, 1,  LK, [128]],                           # 30   80
   [ 4, 1,  LK, [256]],                           # 31   80
   [22, 1, LK, [128]],                            # 32   80
   [[-1, 30, 31], 1, ConcatP3_out, [128,512,256]],# 33 cat head P3 80
   [-1, 1, SPP, [256, [5, 9, 13]]],               # 34
   [-1, 3, C3, [256, False]],                     # 35(P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],                    # 36   40
   [-1, 1,  LK, [256]],                           # 37   40
   [ 6, 1,  LK, [512]],                           # 38   40
   [16, 1, LK, [256]],                            # 39   40
   [[-1, 37, 38], 1, ConcatP4_out, [256,1024,512]],#40 cat head P4
   [-1, 1, SPP, [512, [3, 7, 11]]],               # 41
   [-1, 3, C3, [512, False]],                     # 42(P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                    # 43
   [-1, 1,  LK, [512]],                           # 44  20
   [10, 1, LK, [512]],                           # 45  20
   [[-1, 44], 1, ConcatP5_out, [512,1024]],       # 46 cat head P5
   [-1, 1, SPP, [1024, [3, 5, 7]]],               # 47
   [-1, 3, C3STR, [1024, False]],                  # 48(P5/32-large)


   [[28, 35, 42, 48], 1, Detect, [nc,anchors]],   # Detect(P2, P3, P4, P5)
#
#   [ -1, 1, Conv, [128, 3, 2]],                   # 23   80
#   [[-1, 18, 4], 1, ConcatP3_out, [128,256,256]], # 24 cat head P3
#                                                                               # [-1, 1, SPP, [256, [5, 9, 13]]],               # 26
#   [ -1, 3, C3, [256, False]],                   # 25(P3/8-small)
#   [-1, 1, PSA, [256]],                           # 26
#
#   [-1, 1, Conv, [256, 3, 2]],                    # 27
#   [[-1, 14, 6], 1, ConcatP4_out, [256,1024,512]], # 28 cat head P4
#                                                                                  # [-1, 1, SPP, [512, [3, 7, 11]]],               # 31
#   [-1, 3, C3, [512, False]],                     # 29(P4/16-medium)
#   [-1, 1, PSA, [512]],                           # 30
#
#   [-1, 1, Conv, [512, 3, 2]],                    # 31
#   [[-1, 10], 1, ConcatP5_out, [512,512]],        # 32cat head P5
#                                                                                  #[-1, 1, SPP, [1024, [3, 5, 7]]],               # 36
#   [-1, 3, C3TR, [1024, False]],                  # 33(P5/32-large)
#   [-1, 1, PSA, [1024]],                          # 34
#   [[22, 26, 30, 34], 1, Detect, [nc,anchors]],   # Detect(P2, P3, P4, P5)

  ]

#
